# SetFlowConvertionServerInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..SetFlowConvertionServerInfo Method
PipeSettings Class See Also
---
Set the MEPServerInfo of the current plumbing flow convertion server.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetFlowConvertionServerInfo(
	MEPCalculationServerInfo serverInfo
)
```

Visual Basic
---
```text
Public Sub SetFlowConvertionServerInfo ( _
	serverInfo As MEPCalculationServerInfo _
)
```

Visual C++
---
```text
public:
void SetFlowConvertionServerInfo(
	MEPCalculationServerInfo^ serverInfo
)
```

# ### Parameters
serverInfo
    Type: Autodesk.Revit.DB..::..MEPCalculationServerInfo
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace